quest_system_4941816_name=^?^Carl and Martha
quest_system_4941816_stage_0=^?^Give Carl's letter to Martha di Gonda.
quest_system_4941816_stage_1=^?^Find Old Chvakha and ask her for the "Rejuvenation Potion."
quest_system_4941816_stage_2=^?^Gather 5 red lilies for Old Chvakha. Gathered [count]/5
quest_system_4941816_stage_3=^?^Bring the lilies to Chvakha.
quest_system_4941816_stage_4=^?^Bring Martha the "Rejuvenation Potion."
quest_system_4941816_stage_5=^?^Return to Carl with Martha's answer.
quest_system_4941816_task=^?^Help Carl with his love affair: find Martha in the Marshan Swamp.<br>[reward]
